chore: update README sequence diagram
